//----------------------------------------------------------------------------------------------------------
//Axon.cpp
//功能模块：Axon类，继承于Synapse；目的：声明轴突，增加IsValid()判断函数；为树突提供连接
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

#include "Synapse.hpp"
#include "Axon.hpp"
#include <iostream>
#include <string>
#include <sstream>
#include <stdexcept>
#include <cmath>

//----------------------------------------------------------------------------------------------------------
//函数名称：Axon（构造函数）
//函数功能：构造Axon类，给Weight赋值为1
//参数：无
//返回值：无
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

Axon::Axon() : Synapse(1) {
    //空函数体
}

//----------------------------------------------------------------------------------------------------------
//函数名称：operator= (赋值运算符)
//函数功能：为Axon类赋值
//参数：const Axon& Source，输入参数
//返回值：Axon&
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

Axon& Axon::operator=(const Axon& Source) {
    try
    {
        IsValid(Source);    //判断用于赋值的对象是否合法，若不合法则转到catch语句
    }
    catch(const std::exception& e)
    {
        std::cerr << e.what() << '\n';
        std::cout << "The weight from source will not value your Axon." << std::endl;
    }
    try
    {
        IsValid();          //判断被赋值对象是否合法，若不合法则转到catch语句
    }
    catch(const std::exception& e)
    {
        std::cerr << e.what() << '\n';
        std::cout << "Your Axon will be valued 1." << std::endl;
    }
    Synapse::SetWeight(1);
    return *this;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：Axon（构造函数）
//函数功能：为Axon类赋值
//参数：const Axon& Source，输入参数
//返回值：无
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

Axon::Axon(const Axon& Source) {
    *this = Source;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：~Axon（析构函数）
//函数功能：析构Axon类
//参数：无
//返回值：无
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

Axon::~Axon() {
    //空函数体
}

//----------------------------------------------------------------------------------------------------------
//函数名称：Isvalid()
//函数功能：判断Axon类对象权重是否为1，若不为1则返回错误信息
//参数：double Weight，输入参数
//返回值：bool
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

bool Axon::IsValid(double Weight) {
    if (abs(Weight - 1.0) > 1e-6)   //若权重不为1
    {
        throw std::invalid_argument("Error: Weight of your Axon does not equal to 1!");
        return false;
    }
    else
    {
        return true;
    }
}

//----------------------------------------------------------------------------------------------------------
//函数名称：Isvalid()
//函数功能：判断Axon类对象权重是否为1，若不为1则返回错误信息
//参数：const Axon& Source，输入参数
//返回值：bool
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

bool Axon::IsValid(const Axon& Source) {
    return IsValid(Source.GetWeight());
}

//----------------------------------------------------------------------------------------------------------
//函数名称：Isvalid()
//函数功能：判断Axon类对象权重是否为1，若不为1则返回错误信息
//参数：无
//返回值：bool
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------

bool Axon::IsValid() const {
    return IsValid(this->GetWeight());
}

//----------------------------------------------------------------------------------------------------------
//函数名称：ToString()
//函数功能：将Axon的信息整合成一个string
//参数：无
//返回值：string
//开发者：Jason Cheng   日期：2025/7/18
//更改记录
//----------------------------------------------------------------------------------------------------------


std::string Axon::ToString() const {
    std::ostringstream Stream;
    Stream << "**Axon**" << std::endl;
    Stream << "Weight:\t" << GetWeight() << std::endl;
    return Stream.str();
}

/*
int main() {
    Axon a1, a2;
    a1 = a2;
    a2 = a1;
    std::cout << a1.ToString() << std::endl;
}
*/