//----------------------------------------------------------------------------------------------------------
//Synapse.cpp
//功能模块与目的：定义Synapse类中的函数
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------
 
#include "Synapse.hpp"
#include <iostream>
#include <sstream>
#include <string>

//----------------------------------------------------------------------------------------------------------
//函数名称：Synapse（构造函数）
//函数功能：构造Synapse类
//参数：double Weight = 1,输入参数
//返回值：无
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------

Synapse::Synapse(double Weight) {
    m_rWeight = Weight;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：operator= (赋值运算符)
//函数功能：为Synapse类赋值
//参数：const Synapse& Source，输入参数
//返回值：Synapse&
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------

Synapse& Synapse::operator=(const Synapse& Source) {
    m_rWeight = Source.GetWeight();
    return *this;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：Synapse（拷贝构造函数）
//函数功能：拷贝构造Synapse类
//参数：const Synapse& Source，输入参数
//返回值：无
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------

Synapse::Synapse(const Synapse& Source) {
    m_rWeight = Source.GetWeight();
}

//----------------------------------------------------------------------------------------------------------
//函数名称：~Synapse（虚析构函数）
//函数功能：析构Synapse类
//参数：无
//返回值：无
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------

Synapse::~Synapse() {
    //空函数体
}

//----------------------------------------------------------------------------------------------------------
//函数名称：Signal
//函数功能：输出信号，Signal = Input * Weight
//参数：double Input
//返回值：double
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------

double Synapse::Signal(double Input) const {
    return Input * m_rWeight;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：GetWeight
//函数功能：获取该突触的权重
//参数：无
//返回值：double
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------

double Synapse::GetWeight() const {
    return m_rWeight;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：SetWeight
//函数功能：设置突触的权重
//参数：double Weight_set
//返回值：无
//开发者：Jason Cheng   日期：2025/7/17
//更改记录
//----------------------------------------------------------------------------------------------------------

void Synapse::SetWeight(double Weight_set) {
    m_rWeight = Weight_set;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：ToString
//函数功能：将突触的信息整合为一个字符串
//参数：无
//返回值：string
//开发者：Jason Cheng   日期：2025/7/17
//更改记录：
//----------------------------------------------------------------------------------------------------------

std::string Synapse::ToString() const {
    std::ostringstream Stream;
    Stream << "**Synapse**" << std::endl;
    Stream << "Weight:\t" << m_rWeight << std::endl;
    return Stream.str();
}