//----------------------------------------------------------------------------------------------------------
//Importer.cpp
//功能模块：Importer类的成员函数；目的：定义ANNImporter类的成员函数
//开发者：Jason Cheng   日期：2025/7/25
//更改记录：
//----------------------------------------------------------------------------------------------------------

#include <cstring>
#include <stdexcept>

#include "Importer.hpp"

//----------------------------------------------------------------------------------------------------------
//函数名称：Importer（构造函数）
//函数功能：构造一个Importer类对象
//参数：const char* SetFileName = 0 输入参数
//返回值：无
//开发者：Jason Cheng   日期：2025/7/25
//更改记录
//----------------------------------------------------------------------------------------------------------

Importer::Importer(const char* SetFileName) {
    if(strlen(SetFileName) >= 100)                  //如果文件名过长，throw错误信息
    {
        throw std::invalid_argument("Error: Your File Path is too long!");
    }
    strcpy_s(this->m_FileNamePath, 99, SetFileName);
}

//----------------------------------------------------------------------------------------------------------
//函数名称：operator=
//函数功能：实现赋值运算符的重载
//参数：const Importer& Source  输入参数
//返回值：Importer&
//开发者：Jason Cheng   日期：2025/7/25
//更改记录
//----------------------------------------------------------------------------------------------------------

Importer& Importer::operator=(const Importer& Source) {
    strcpy_s(this->m_FileNamePath, 99, Source.m_FileNamePath);
    return *this;
}

//----------------------------------------------------------------------------------------------------------
//函数名称：Importer（构造函数）
//函数功能：构造一个Importer类对象
//参数：const Importer& Source  输入参数
//返回值：无
//开发者：Jason Cheng   日期：2025/7/25
//更改记录
//----------------------------------------------------------------------------------------------------------

Importer::Importer(const Importer& Source) {
    strcpy_s(this->m_FileNamePath, 99, Source.m_FileNamePath);
}

//----------------------------------------------------------------------------------------------------------
//函数名称：~Importer（析构函数）
//函数功能：析构一个Importer类对象
//参数：无
//返回值：无
//开发者：Jason Cheng   日期：2025/7/25
//更改记录
//----------------------------------------------------------------------------------------------------------

Importer::~Importer() {
    //空函数体
}

//----------------------------------------------------------------------------------------------------------
//函数名称：ImportFile
//函数功能：导入一个文件
//参数：const char* SetFileName     输入参数
//返回值：无
//开发者：Jason Cheng   日期：2025/7/25
//更改记录
//----------------------------------------------------------------------------------------------------------

void Importer::ImportFile(const char* SetFileName) {
    //和构造函数作用相同
    if(strlen(SetFileName) >= 100)                  //如果文件名过长，throw错误信息
    {
        throw std::invalid_argument("Error: Your File Path is too long!");
    }
    strcpy_s(this->m_FileNamePath, 99, SetFileName);
}

//----------------------------------------------------------------------------------------------------------
//函数名称：clear
//函数功能：清除该导入器中存放的路径
//参数：无
//返回值：无
//开发者：Jason Cheng   日期：2025/7/25
//更改记录
//----------------------------------------------------------------------------------------------------------

void Importer::clear() {
    strcpy_s(this->m_FileNamePath, 100, "");
}

//----------------------------------------------------------------------------------------------------------
//函数名称：GetFileName
//函数功能：获取当前文件路径
//参数：无
//返回值：const char*
//开发者：Jason Cheng   日期：2025/7/25
//更改记录
//----------------------------------------------------------------------------------------------------------

const char* Importer::GetFileName() const {
    return m_FileNamePath;
}
