//----------------------------------------------------------------------------------------------------------
//View.hpp
//功能模块：View类；目的：显示用户界面
//开发者：Jason Cheng   日期：2025/8/1
//更改记录：
//----------------------------------------------------------------------------------------------------------

#ifndef VIEW_HPP
#define VIEW_HPP

//----------------------------------------------------------------------------------------------------------
//类名：View
//功能：显示用户界面
//接口： 
/*
    *   static void StartView();
    *   static void Main();
    *   static void Branch3();
    *   static void Branch5();
*/
//开发者：Jason Cheng   日期：2025/8/1
//更改记录：
//----------------------------------------------------------------------------------------------------------

class View {
    public:
        static void StartView();
        static void Main();
        static void Branch3();
        static void Branch5();
    private:
        //无私有数据成员
};

#endif /*VIEW_HPP*/